<?php

return [
    'patient_updated' => 'Пацієнта успішно оновлено!',
    'user_updated' => 'Користувача успішно оновлено!',
    'appointment_created' => 'Запис на прийом успішно створено!',
    'patient_created' => 'Пацієнта успішно створено!',
    'medcard_uploaded' => 'Медична картка успішно завантажена!',
    'intake_uploaded' => 'Вступні дані успішно завантажено!',
    'no_available_staff' => 'На вибраний час не знайдено вільних співробітників.',
    'no_available_ward' => 'Для вибраної процедури у вашому центрі не знайдено жодної палати.',
];
